read_verilog -netlist ../netlist/IIR_filter.v
read_saif -input ../saif/myiir_syn.saif -instance tb_iir/UUT -unit ns -scale 1

create_clock -name MY_CLK CLK

report_power > ./report/report_power.rpt

exit
