###################################################################

# Created by write_sdc on Fri Nov 19 20:20:53 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports VOUT]
set_load -pin_load 3.40189 [get_ports {DOUT[13]}]
set_load -pin_load 3.40189 [get_ports {DOUT[12]}]
set_load -pin_load 3.40189 [get_ports {DOUT[11]}]
set_load -pin_load 3.40189 [get_ports {DOUT[10]}]
set_load -pin_load 3.40189 [get_ports {DOUT[9]}]
set_load -pin_load 3.40189 [get_ports {DOUT[8]}]
set_load -pin_load 3.40189 [get_ports {DOUT[7]}]
set_load -pin_load 3.40189 [get_ports {DOUT[6]}]
set_load -pin_load 3.40189 [get_ports {DOUT[5]}]
set_load -pin_load 3.40189 [get_ports {DOUT[4]}]
set_load -pin_load 3.40189 [get_ports {DOUT[3]}]
set_load -pin_load 3.40189 [get_ports {DOUT[2]}]
set_load -pin_load 3.40189 [get_ports {DOUT[1]}]
set_load -pin_load 3.40189 [get_ports {DOUT[0]}]
create_clock [get_ports CLK]  -name myCLOCK  -period 11.84  -waveform {0 5.92}
set_clock_uncertainty 0.07  [get_clocks myCLOCK]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports RST_n]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports VIN]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DIN[13]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DIN[12]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DIN[11]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DIN[10]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DIN[9]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DIN[8]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DIN[7]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DIN[6]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DIN[5]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DIN[4]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DIN[3]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DIN[2]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DIN[1]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DIN[0]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {A_1[13]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {A_1[12]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {A_1[11]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {A_1[10]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {A_1[9]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {A_1[8]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {A_1[7]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {A_1[6]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {A_1[5]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {A_1[4]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {A_1[3]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {A_1[2]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {A_1[1]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {A_1[0]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_0[13]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_0[12]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_0[11]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_0[10]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_0[9]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_0[8]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_0[7]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_0[6]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_0[5]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_0[4]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_0[3]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_0[2]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_0[1]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_0[0]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_1[13]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_1[12]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_1[11]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_1[10]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_1[9]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_1[8]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_1[7]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_1[6]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_1[5]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_1[4]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_1[3]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_1[2]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_1[1]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {B_1[0]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports VOUT]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DOUT[13]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DOUT[12]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DOUT[11]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DOUT[10]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DOUT[9]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DOUT[8]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DOUT[7]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DOUT[6]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DOUT[5]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DOUT[4]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DOUT[3]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DOUT[2]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DOUT[1]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DOUT[0]}]
