read_verilog -netlist ../netlist/RISCV.v
read_saif -input ../saif/RISCV.saif -instance tb_riscv/UUT -unit ns -scale 1

create_clock -name MY_CLK CLK

report_power > ./report/report_power.rpt

exit
