###################################################################

# Created by write_sdc on Tue Feb  8 19:39:35 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {PC_OUT[31]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[30]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[29]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[28]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[27]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[26]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[25]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[24]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[23]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[22]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[21]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[20]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[19]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[18]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[17]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[16]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[15]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[14]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[13]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[12]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[11]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[10]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[9]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[8]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[7]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[6]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[5]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[4]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[3]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[2]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[1]}]
set_load -pin_load 3.40189 [get_ports {PC_OUT[0]}]
set_load -pin_load 3.40189 [get_ports RM_OUT]
set_load -pin_load 3.40189 [get_ports WM_OUT]
set_load -pin_load 3.40189 [get_ports {DM_ADD[31]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[30]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[29]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[28]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[27]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[26]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[25]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[24]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[23]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[22]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[21]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[20]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[19]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[18]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[17]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[16]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[15]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[14]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[13]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[12]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[11]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[10]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[9]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[8]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[7]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[6]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[5]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[4]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[3]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[2]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[1]}]
set_load -pin_load 3.40189 [get_ports {DM_ADD[0]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[31]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[30]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[29]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[28]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[27]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[26]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[25]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[24]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[23]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[22]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[21]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[20]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[19]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[18]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[17]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[16]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[15]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[14]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[13]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[12]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[11]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[10]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[9]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[8]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[7]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[6]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[5]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[4]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[3]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[2]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[1]}]
set_load -pin_load 3.40189 [get_ports {DM_DIN[0]}]
create_clock [get_ports CLK]  -name myCLOCK  -period 6  -waveform {0 3}
set_clock_uncertainty 0.07  [get_clocks myCLOCK]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports RST_N]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[31]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[30]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[29]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[28]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[27]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[26]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[25]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[24]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[23]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[22]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[21]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[20]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[19]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[18]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[17]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[16]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[15]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[14]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[13]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[12]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[11]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[10]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[9]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[8]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[7]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[6]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[5]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[4]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[3]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[2]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[1]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {IMem_IN[0]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[31]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[30]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[29]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[28]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[27]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[26]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[25]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[24]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[23]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[22]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[21]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[20]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[19]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[18]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[17]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[16]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[15]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[14]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[13]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[12]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[11]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[10]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[9]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[8]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[7]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[6]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[5]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[4]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[3]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[2]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[1]}]
set_input_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DOUT[0]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[31]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[30]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[29]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[28]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[27]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[26]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[25]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[24]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[23]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[22]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[21]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[20]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[19]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[18]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[17]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[16]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[15]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[14]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[13]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[12]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[11]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[10]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[9]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[8]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[7]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[6]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[5]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[4]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[3]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[2]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[1]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {PC_OUT[0]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports RM_OUT]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports WM_OUT]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[31]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[30]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[29]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[28]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[27]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[26]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[25]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[24]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[23]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[22]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[21]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[20]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[19]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[18]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[17]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[16]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[15]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[14]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[13]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[12]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[11]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[10]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[9]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[8]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[7]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[6]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[5]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[4]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[3]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[2]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[1]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_ADD[0]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[31]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[30]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[29]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[28]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[27]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[26]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[25]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[24]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[23]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[22]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[21]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[20]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[19]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[18]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[17]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[16]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[15]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[14]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[13]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[12]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[11]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[10]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[9]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[8]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[7]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[6]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[5]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[4]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[3]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[2]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[1]}]
set_output_delay -clock myCLOCK  -max 0.5  [get_ports {DM_DIN[0]}]
